module.exports = {
  command: 'استغفار',

  async execute(sock, msg) {
    const chat = msg.key.remoteJid;

    const text = `
🤍 *أذكار الاستغفار* 🤍

📿 أستغفر الله وأتوب إليه.

📿 أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه.

📿 رب اغفر لي وتب علي إنك أنت التواب الرحيم.

📿 اللهم إنك عفو تحب العفو فاعف عني.

📿 أستغفر الله من كل ذنب أذنبته، وأتوب إليه.

📿 أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه (100 مرة).

🌿 قال الله تعالى:
﴿وَاسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ﴾

🤍 اللهم اغفر لي ذنوبي كلها، دقها وجلها، أولها وآخرها، سرها وعلانيتها.
`;

    await sock.sendMessage(chat, {
      text: text
    }, { quoted: msg });
  }
};