module.exports = {
  command: 'عاصمة',

  async execute(sock, msg) {
    const chat = msg.key.remoteJid;

    const body =
      msg.message?.conversation ||
      msg.message?.extendedTextMessage?.text ||
      '';

    const country = body.replace('.عاصمة', '').trim();

    const capitals = {
      "فلسطين": "القدس",
      "مصر": "القاهرة",
      "السعودية": "الرياض",
       "كاناو": "عالم الانمي",
      "الإمارات": "أبوظبي",
      "قطر": "الدوحة",
      "الكويت": "الكويت",
      "البحرين": "المنامة",
      "عمان": "مسقط",
      "اليمن": "صنعاء",
      "الأردن": "عمّان",
      "سوريا": "دمشق",
      "لبنان": "بيروت",
      "العراق": "بغداد",

      "المغرب": "الرباط",
      "الجزائر": "الجزائر",
      "تونس": "تونس",
      "ليبيا": "طرابلس",
      "السودان": "الخرطوم",

      "تركيا": "أنقرة",
      "روسيا": "موسكو",
      "أوكرانيا": "كييف",
      "فرنسا": "باريس",
      "ألمانيا": "برلين",
      "إيطاليا": "روما",
      "إسبانيا": "مدريد",
      "بريطانيا": "لندن",
      "البرتغال": "لشبونة",
      "هولندا": "أمستردام",
      "بلجيكا": "بروكسل",
      "سويسرا": "برن",
      "النمسا": "فيينا",
      "اليونان": "أثينا",

      "أمريكا": "واشنطن",
      "كندا": "أوتاوا",
      "المكسيك": "مكسيكو سيتي",
      "البرازيل": "برازيليا",
      "الأرجنتين": "بوينس آيرس",
      "تشيلي": "سانتياغو",

      "الصين": "بكين",
      "اليابان": "طوكيو",
      "كوريا الجنوبية": "سيول",
      "الهند": "نيودلهي",
      "باكستان": "إسلام آباد",
      "إندونيسيا": "جاكرتا",
      "ماليزيا": "كوالالمبور",
      "تايلاند": "بانكوك",
      "الفلبين": "مانيلا",
      "فيتنام": "هانوي",
      "بنغلاديش": "دكا",
      "سنغافورة": "سنغافورة",

      "أستراليا": "كانبرا",
      "نيوزيلندا": "ويلينغتون",

      "جنوب أفريقيا": "بريتوريا",
      "نيجيريا": "أبوجا",
      "كينيا": "نيروبي",
      "إثيوبيا": "أديس أبابا",

      "النرويج": "أوسلو",
      "السويد": "ستوكهولم",
      "الدنمارك": "كوبنهاغن",
      "فنلندا": "هلسنكي",
      "بولندا": "وارسو",
      "التشيك": "براغ",
      "رومانيا": "بوخارست",
      "بلغاريا": "صوفيا",
      "المجر": "بودابست",
      "أيرلندا": "دبلن",

      "كولومبيا": "بوغوتا",
      "بيرو": "ليما",
      "فنزويلا": "كاراكاس",
      "كوبا": "هافانا"
    };

    if (!country) {
      return sock.sendMessage(chat, {
        text: "🌍 اكتب الدولة\nمثال:\n.عاصمة مصر"
      }, { quoted: msg });
    }

    if (!capitals[country]) {
      return sock.sendMessage(chat, {
        text: "❌ الدولة غير موجودة بالقائمة"
      }, { quoted: msg });
    }

    await sock.sendMessage(chat, {
      text: `🌍 الدولة: ${country}\n🏛️ العاصمة: ${capitals[country]}`
    }, { quoted: msg });
  }
};